# coding: utf8
from __future__ import unicode_literals

# List of stop words
STOP_WORDS = set(
    """
    አብዚ ኣውዚ ኣይቲ ኮይኖም ኮነ ኾነ ኾኔ ኰነ ይኹን ከምኡ ውን ከይኮነ 
    ከይኾነ ከምኡ እንተዘየሎ እንተአየለ እንተኾነግን ኮይኑ ኾይኑ ብዝተረፈ እንተዘይኮይኑ 
    እንተዘይኾይኑ ስለዚ ምእንትዚ ስለዚ’ውን ምዃኑ ምዃኑን እዋን ወሮ ኣይተ ወት ኣቶ ብሓፈሽኡ ከምዘሎ 
    ከምዘየሎ ከምዘየለ ካብ ኻብ ሓንቲ ይዕበ ይንአስ ዝኰነ ልዑል ትሑት ከሎ 
    ኸሎ ክኸውን ኽኸውን ልኾን ኻልኣይ ካልኣይ ኣዝዮም ሓደ ናበይ 
    ላበይ ክዓቢ ክንእስ ኣለዎ እንሀዎ ክብል ክፀውይ ከለኹ ኸለኹ 
    እንከለኹ ትነሀኹ ካልኦት ኣለና እንሀና ናትካ ናኣትኻ ወዲ ሰበይቲ ሰብአይ ንኣይ 
    ንዓይ ዝብል ልብል ኣቱም ኣንቱም ኢልኩም ብልኹም ኢልክን ብልኽን ይኽእል 
    ይከአል ወላ ዋላ ንቐፃሊ ኮይኑኒ ኾኑኒ ብዙሕ መዓት ጀሚሩ ሞኪሩ ዘለኻ 
    ለለኻ ልንሀኻ ዘለኺ ለለኺ ልንሀኺ ንሶም እቶሙ ንሳተን እተኑ ኣለካ ኣለኻ 
    እነሀኻ ኣለኺ እነሀኺ ንኸምዚ ኻምዚ ካምዚ ሃምዚ ኢለ ብለ ይኸውን ይኾን ምክንያቱ 
    ምኽንያቱ ነዛ ነቱ ነይሩ ፀኒሑ ፀንሑ ኮነ ኾነ እንዳ ዳ ካልእ ኻልእ ዝኾነት ልኾነት ኢና ምስ ምስምስ ኮታስ ነናይ ነይርዎም እተን 
    እተኑ ዳርጋ ናይዞም ናተሙ ብድሕሪኡ እዘን እዘኑ ብዘየካ ብዘይካ ብኹላ ካብዚ ኻብዚ ከምቲ ከምቱ ከምተን ምስ’ቲ በጀካ በጃኻ ኣዝዩ ኣዐርዩ እስከ 
    እስኪ ዳኣ በቃ ከለኺ እንተለኺ ከለኻ እንተለኻ እንተሎ እንከሎ ንኡስ ንኣስታት 
    ንከባቢ ዝብል ልብል ዘለዎ ለለዎ ኣስታት ከባቢ ንክኮኑ ንኽኾኑ ልዕሊ ትሕቲ ከምዘሎን ከምለሎ ዘለዋ 
    ለለዋ ሐዚግን ሕጂግን ሕዪግን ሕዚግን ዛጊድ ዘኽቲ እንድሕር ከምዘስዕብ እዘን ዘለወን ለለወን ብምዃን እንትኾና ኮይኖም 
    ኾይኖም ዝረኽቡ ልረኽቡ ኾይኖም ኮይኖም እንተኾነ ካብኣቶም ካብዚኣቶም ካብዚኣተን ካብኣተን ሕድሕድኦም ዝግባእ ዝኾና እንዳ ምስኦም 
    ሒዞም ዝኣኽሉ ዝኣኽላ ካብዞም ካብዘን ሕድሕድ ይኹኑ ይኹና ይኹን ይኽእሉ ይኽእላ ካልእ 
    ኻልእ ካልእ ከምቲ ካምቲ በተን ብብዙሕ ናይዚኦም ምዃንኩም ኢሎም እንትረኣ ንምዃን ቀንዲ 
    ዋና ነዘን ንተን በዞም ኣለውዎ እንተ ስለዘለውና ብተወሳኺ ከምዝነበረ ዘይኮነስ ካብዚኦም ሳላ 
    ሻላ ብሳላ ትኹን ዛዕባና ኣብቶም ኣብተን በብ በቢ ምስተን 
    ምስቶም ግደ እጃም መላእ ኮይንካ እምብኣር ብእኡ ብኡ
    ከምዝስዕብ ብምሉእ ኾይኖም ኮይኖም ይህልዎም ኣይኮነትን ዳርጋ ዋሕዚ ከቶ ጭራሽ እንተሃለወ 
    እንተሃለየ ንዕኡ ምስከደ ምዃነን ኣይኮንኩን ዘይኮነ ንኸይህልዎም ዝኣመሳሰሉ 
    ዝመሰሉ ልበሉ ኣቢሉ ኣቢላ ዛዕባ እስኪ ብኸመይን ከይኮነ 
    ተይኮነ ብዙሓት ውሑዳት ዝሓዘ ልሓዘ ዋንኡ ኣይኾንን ኣይከነን ይኹንዳኣምበር ኢኹም ዶ ኣብዚኣማ 
    እዛው ለካ ካማን ብሓፈሻ ኣብቲ ኣፍቲ ማለት እዩ
    ይኡ ከም ነቲ ኣብ ከማኻ ከምዘለኺ ከምዘለዎ እቲ 
    እትው ወይ ድማ ደማ ክሳብ ክሳዕ ክሻብ 
    ኽሳብ እስካብ መን ኣበይ እምበር በቶም ነዚ ይኹን ኣሎ እነሆ እዚ ዝኾነ ልኾነ ኸዓ ክኣ 
    ከዓ ኽኣ ለለ እዛ እዛው ኣይኮነን እንታይ ታይ እታ ካብ ነይሮም 
    ፀንሖም ከምቶም እቶም እቶሙ ከምዘለኒ ከምዘለኩም እውን ውን ኣብዚ 
    ኣብዝው ኣብታው ነበሩ ነበረ ኩሉ ብኹሉ 
    ኹሉ ኣነ ንስኻ ንስኺ ዘለው ለለው ንሱ ንሳ ንሕና ንስኻትኩም ንስኻትክን ስጋዕ ብዛዕባ 
    ከለዋ ነታ ናብ ዘለኒ ግን ጥራሕ ካብቶም እኳ ኳ ምዃኖም ብኦኦም በቲ ብቲ ክኾና ብዘይ ብለይ
    ምእንቲ ስለ እሞ ዘለኩም ድሕሪ ቅድሚ በዚ ብዚ በኦኦም በዙይ ናይዞም ኩሎም ኢሎም ዘለክን ናይቲ እንተድኣ ናይ ዘለዎም ለለዎም
    ከምኡውን እዮም ካብተን ድኣ ናይዞም ናይዘን ናይቶም ናይተን አብዚኦም እዙይ 
    እዝው እዚኣ እዝዋ ዘለዋ የብለንን የብለይን እንተዝኾና እዚኦም ዘለወን ከምዘለኪ ስለዝኾነ 
    ስለዝኮነ ነይርወን ዘለወን ዝባሃላ ምስቲ ዘለኪ ምዃና የለን 
    የልቦን የለይ ኮይኑ ስለዝኾነውን ከምኡ ኸምኡ ሃምኡ ምዃን የለዋን ምስ ምስምስ ከማይ የብሉን ከማና ኩለን እያ ይአ ናይዘን ናይቶም ዝኾነኮይኑ 
    ኣብዛ ኣብዚኣ ኣላ እንሃ የብልናን የብልካን ከምተን ኢሉ ኢላ ኢለን ኣይኮኑን የብሎምን ከምዚኣቶም ከምዚኣተን ኣይኮነትን ከምቶም ዘለና ዘለካ ዘሎ 
    ልንሆ ድንሆ የለዉን ዘላ ይኹን እምበር ይኹን ደኣ’ምበር የብላን ወዘተ 
    ካልኦትእውን ስለዝኾኑ ስለዝኾና ስለዝኾነት ስለዝኾንኩ ብምዃንኩም ቅድሚ ቅድሚት ከምዘለና ከምዘለኻ ከምዘለኽን ናትና 
    ናኣትና ናታትክን ንሳተን ነቱይ ከምአን እየን ኩላተን ብምዃንክን ብምዃንኪ ብምዃኑ ነቶም 
    ነዞም ከከም ኩሉኹም ኩልኽን ስለዝኾንና ስለዝኾንክን ከለው ከምዘለካ ስለዝኾንኩም ኩላትና ከማኽን ከማኹም 
    ከምኣቶም ከምኣተን ኣብዝሓ ብኣብዝሓ ካሊእ ክንዲቲ ከምታ ካልኦት ብኣጠቓለልኡ 
    """.split()
)

contractions = ['ዓ.ም', 'አ.ም', 'ጠ.ሚ', 'ኪ.ሜ', 'አ.አ', 'ም.ቤት', 'ም.ቤቱ', 'ጽ.ቤት', 'ፓ.ር', 'ት.ት', 'ወ.ሮ', 'ዶ.ር']

STOP_WORDS.update(contractions)

for stopword in contractions:
    STOP_WORDS.add(stopword.replace("'", "/"))